body_xml.xml

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
  <soap:Body>
    <GetLPGDemandSupplyMonthlyJSON xmlns="https://webservice.eppoengdb.go.th/">
      <strUser>set</strUser>
      <strPassword>set</strPassword>
      <yy></yy>
      <mm></mm>
    </GetLPGDemandSupplyMonthlyJSON>
  </soap:Body>
</soap:Envelope>